{
  "backend/main.mo": "Defines user, artist, artwork, submission, and inquiry types with maps for storage, plus access control and helpers for generating public-safe profile and artwork data.",
  "feature_evidence.json": "Feature evidence report specifying removal of a header element, listing affected file paths, components, test IDs, and confidence.",
  "frontend-file-summaries.txt": "JSON-style text file summarizing key frontend files such as layout components, pages, gallery features, and submission flow.",
  "frontend/index.css": "Global Tailwind layers defining light and dark theme CSS variables and applying background, text, and border styling.",
  "frontend/index.html": "Base HTML document that mounts the React app and loads main.tsx as a module script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, layout, admin guards, and global UI elements like toasts and the profile setup modal.",
  "frontend/src/components/admin/InquiriesTab.tsx": "Admin table view that loads and displays all purchase inquiries with artwork previews, buyer info, and timestamps.",
  "frontend/src/components/admin/ReplaceDatasetControl.tsx": "Admin control providing a destructive action to replace all stored data with demo data using a confirmation dialog.",
  "frontend/src/components/admin/SubmissionsTab.tsx": "Displays artwork submissions for admins with filtering, image previews, and approve/reject actions.",
  "frontend/src/components/artists/CreateArtistProfileForm.tsx": "Form for creating an artist profile with validation, submission handling, and success/error states.",
  "frontend/src/components/artists/EditArtistProfileForm.tsx": "Loads an existing artist profile and provides a form to update it with validation and status messaging.",
  "frontend/src/components/artworks/EditArtworkForm.tsx": "Form to edit artwork details including title, description, price, and optional image replacement with preview.",
  "frontend/src/components/artworks/SoldArtworkImage.tsx": "Wraps an artwork image and conditionally overlays a SOLD watermark.",
  "frontend/src/components/artworks/SoldWatermarkOverlay.tsx": "Renders a styled SOLD watermark overlay in various sizes.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Guards admin routes by checking authentication and admin authorization, showing relevant prompts or content.",
  "frontend/src/components/auth/LoginButton.tsx": "Button that handles login/logout with Internet Identity and shows loading or authenticated state.",
  "frontend/src/components/auth/MyIdDialog.tsx": "Dialog that displays and allows copying the authenticated user's principal ID, with fallback messaging when not logged in.",
  "frontend/src/components/auth/PrincipalDisplay.tsx": "Shows a truncated version of the user's principal identifier in a compact, styled container.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to complete their profile, including avatar upload and form submission handling.",
  "frontend/src/components/auth/ProfileSetupProvider.tsx": "Context provider controlling whether the profile setup modal is open, with hooks for accessing and toggling it.",
  "frontend/src/components/gallery/ArtworkCard.tsx": "Renders an artwork preview card with image, artist, price, and navigation, plus optional lightbox view.",
  "frontend/src/components/gallery/GalleryFilters.tsx": "Filter panel allowing users to choose an artwork category and sort order using select inputs.",
  "frontend/src/components/images/ArtworkImage.tsx": "Reusable image component that validates URLs and shows descriptive fallback UI when loading fails.",
  "frontend/src/components/images/ArtworkLightbox.tsx": "Fullscreen dialog for viewing artwork images with optional SOLD watermark and a close button.",
  "frontend/src/components/inquiries/PurchaseInquiryDialog.tsx": "Dialog for submitting purchase inquiries, handling authentication, profile completion checks, and form submission states.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying copyright, branding, and a link attribution with decorative styling.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with navigation, auth controls, mobile menu, and admin links based on user role.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps all pages with a header, footer, and main content area.",
  "frontend/src/components/submissions/SubmissionConfirmation.tsx": "Displays a confirmation message and submission details after an artwork is submitted.",
  "frontend/src/components/submissions/SubmitArtworkForm.tsx": "Form for submitting artwork with image upload, draft saving, profile checks, and submission handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to the user’s identity and refreshes dependent queries.",
  "frontend/src/hooks/useAdminDashboard.ts": "Provides queries and mutations for admin actions such as viewing, approving, and rejecting submissions and inquiries.",
  "frontend/src/hooks/useArtists.ts": "Hooks for fetching artists, a specific artist, and managing creation and updates of artist profiles.",
  "frontend/src/hooks/useArtworks.ts": "Fetches all public artworks or a specific artwork by ID via the backend actor.",
  "frontend/src/hooks/useAuthz.ts": "Handles user profile fetching, saving, and authorization checks such as determining admin status.",
  "frontend/src/hooks/useDeleteArtwork.ts": "Mutation hook to delete an artwork and invalidate related cached data.",
  "frontend/src/hooks/useEditArtwork.ts": "Provides a mutation hook to edit an artwork and invalidates related artwork and submission queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook handling authentication, identity loading, and login state.",
  "frontend/src/hooks/useMySubmissions.ts": "Fetches the current user's artwork submissions using the actor API, enabled only when authenticated.",
  "frontend/src/hooks/usePurchaseInquiry.ts": "Creates purchase inquiries via mutation and refreshes inquiry-related queries on success.",
  "frontend/src/hooks/useReplaceDataset.ts": "Triggers dataset replacement on the backend and invalidates all major data queries for refresh.",
  "frontend/src/hooks/useSubmitArtwork.ts": "Submits new artwork to the backend and invalidates artwork and submission lists after success.",
  "frontend/src/hooks/useToggleArtworkSoldStatus.ts": "Toggles an artwork's sold status and refreshes artwork and submission related queries.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, and custom gallery-related utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with dataset controls and tabs for submissions and purchase inquiries.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays an artist profile with their artworks and allows owners to edit their profile.",
  "frontend/src/pages/ArtistsPage.tsx": "Shows a list of artists with bios and links to individual profile pages.",
  "frontend/src/pages/ArtworkDetailsPage.tsx": "Displays artwork details, handles owner actions like delete and toggle sold, and manages inquiry and lightbox dialogs with authentication checks.",
  "frontend/src/pages/CreateArtistProfilePage.tsx": "Shows a login prompt if unauthenticated and renders a form for creating an artist profile, navigating to submission on success.",
  "frontend/src/pages/EditArtistProfilePage.tsx": "Allows authenticated users to edit their artist profile or prompts creation if none exists, handling loading and login states.",
  "frontend/src/pages/EditArtworkPage.tsx": "Lets authenticated owners edit artwork, showing appropriate error or loading states and redirecting after form actions.",
  "frontend/src/pages/GalleryPage.tsx": "Fetches and displays artworks with simple filtering and sorting, showing loading and empty states.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero, features, and CTA sections linking to gallery and submission pages.",
  "frontend/src/pages/MyProfilePage.tsx": "Provides a user profile editor with avatar upload, form validation, and save handling for authenticated users.",
  "frontend/src/pages/PendingReviewPage.tsx": "Admin-facing page listing pending artwork submissions via the SubmissionsTab component.",
  "frontend/src/pages/SubmitArtworkPage.tsx": "Page component controlling artwork submission flow, handling auth/profile checks and showing the submission form or confirmation state.",
  "frontend/src/utils/fileToDataUrl.ts": "Converts an image File into a data URL with type and size validation.",
  "frontend/src/utils/gbpMoney.ts": "Utility functions for formatting, parsing, and converting GBP values between strings and minor units.",
  "frontend/src/utils/imageFailureReason.ts": "Provides user-friendly error messages and validation for image URLs.",
  "frontend/src/utils/optionalEmail.ts": "Normalizes optional email fields for backend storage and form display.",
  "frontend/src/utils/submitArtworkDraft.ts": "Manages saving, loading, and clearing artwork submission drafts in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Metadata describing the project's state, features, and pending requests."
}