{
  "backend/main.mo": "Defines the main canister with user, artist, artwork, submission, and inquiry types plus maps and helpers, including conversion to public views and access control integration.",
  "backend/migration.mo": "Provides conversion logic and type mappings to migrate stored data from old artist and artwork structures to new ones with updated username fields.",
  "feature_evidence.json": "Lists feature evidence mapping feature IDs to related frontend files, components, and tests with confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files including layout, pages, components, and configuration.",
  "frontend/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes using OKLCH color values.",
  "frontend/index.html": "Basic HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, global providers, and all application routes including artist profile creation and admin pages.",
  "frontend/src/components/admin/InquiriesTab.tsx": "Renders an admin table of purchase inquiries with loading state, empty state, and inquiry details including artwork and buyer info.",
  "frontend/src/components/admin/ReplaceDatasetControl.tsx": "Provides a destructive admin control with a confirmation dialog to replace all user and artwork data with demo data using a mutation hook.",
  "frontend/src/components/admin/SubmissionsTab.tsx": "Displays all artwork submissions in a table with image previews and allows admins to approve or reject submissions.",
  "frontend/src/components/artists/CreateArtistProfileForm.tsx": "Form for creating a new artist profile with validation, error handling, and success feedback.",
  "frontend/src/components/artists/EditArtistProfileForm.tsx": "Loads the caller’s artist profile and provides a form to update profile fields with validation and feedback.",
  "frontend/src/components/artworks/EditArtworkForm.tsx": "Form to edit an artwork’s details including image preview/upload, price parsing, and error handling.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Guards admin routes by checking authentication and admin status, showing appropriate prompts or content.",
  "frontend/src/components/auth/LoginButton.tsx": "Button that handles login/logout via Internet Identity with loading states and error recovery.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal form for new users to create a profile, including avatar upload, validation, and saving via backend hooks.",
  "frontend/src/components/auth/ProfileSetupProvider.tsx": "Context provider managing open/close state for the profile-setup modal.",
  "frontend/src/components/gallery/ArtworkCard.tsx": "Displays artwork thumbnail, metadata, and price with lightbox support and navigation to artwork details.",
  "frontend/src/components/gallery/GalleryFilters.tsx": "Category and sort filter controls for the gallery using select inputs.",
  "frontend/src/components/images/ArtworkImage.tsx": "Reusable image component handling loading, errors, and optional click interactions while preserving layout.",
  "frontend/src/components/images/ArtworkLightbox.tsx": "Fullscreen lightbox dialog for viewing artwork images with close controls.",
  "frontend/src/components/inquiries/PurchaseInquiryDialog.tsx": "Dialog for submitting a purchase inquiry, handling auth, profile checks, form submission, and success state.",
  "frontend/src/components/layout/SiteFooter.tsx": "Simple site footer with branding and external link attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with navigation links, auth handling, and mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper including header, footer, and main content area.",
  "frontend/src/components/submissions/SubmissionConfirmation.tsx": "Displays a confirmation card after artwork submission, showing submission ID, pending status, and navigation buttons.",
  "frontend/src/components/submissions/SubmitArtworkForm.tsx": "Provides a full artwork submission form with image upload, draft saving, profile checks, and submission handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdminDashboard.ts": "Provides queries and mutations for admins to manage submissions and purchase inquiries, including approve/reject actions.",
  "frontend/src/hooks/useArtists.ts": "Exposes hooks for fetching artist lists, specific artist data, and creating/updating caller artist profiles with cache updates.",
  "frontend/src/hooks/useArtworks.ts": "Fetches all artworks or a specific artwork by ID using the backend actor.",
  "frontend/src/hooks/useAuthz.ts": "Manages user profile retrieval and saving, and checks if the caller has admin privileges.",
  "frontend/src/hooks/useDeleteArtwork.ts": "Provides a mutation for deleting artworks and invalidates related artwork and submission caches.",
  "frontend/src/hooks/useEditArtwork.ts": "Exposes a mutation to edit artwork details and refreshes related cache entries after updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, managing login, identity persistence, and status tracking for authenticated users.",
  "frontend/src/hooks/useMySubmissions.ts": "Fetches the current user's artwork submissions using react-query and Internet Identity.",
  "frontend/src/hooks/usePurchaseInquiry.ts": "Creates purchase inquiries via mutation and invalidates the inquiries query on success.",
  "frontend/src/hooks/useReplaceDataset.ts": "Triggers dataset replacement and invalidates all relevant data queries afterward.",
  "frontend/src/hooks/useSubmitArtwork.ts": "Submits new artwork through an actor call and refreshes artwork and submission queries.",
  "frontend/src/index.css": "Defines Tailwind base styles plus custom color variables and component utility classes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin UI showing submissions, inquiries, and a dataset reset control in tabbed layout.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays an artist profile with their artworks and edit controls for the profile owner.",
  "frontend/src/pages/ArtistsPage.tsx": "Lists all artists with bios, website links, and navigation to individual profiles.",
  "frontend/src/pages/ArtworkDetailsPage.tsx": "Shows detailed artwork info, owner controls, purchase inquiry flow, and deletion dialog.",
  "frontend/src/pages/CreateArtistProfilePage.tsx": "Provides a form for authenticated users to create a new artist profile.",
  "frontend/src/pages/EditArtistProfilePage.tsx": "Allows authenticated artists to edit their profile or prompts creation if none exists.",
  "frontend/src/pages/EditArtworkPage.tsx": "Page for editing an artwork, handling auth, ownership checks, loading states, and rendering an edit form.",
  "frontend/src/pages/GalleryPage.tsx": "Displays all artworks with category filtering, sorting, and loading states.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero, features, and calls to action for exploring the gallery or submitting art.",
  "frontend/src/pages/MyProfilePage.tsx": "User profile editor handling authentication, avatar uploads, form validation, and profile saving.",
  "frontend/src/pages/SubmitArtworkPage.tsx": "Artwork submission flow with auth/profile checks, draft clearing, and a submission form.",
  "frontend/src/utils/fileToDataUrl.ts": "Converts an image File to a data URL with type and size validation.",
  "frontend/src/utils/gbpMoney.ts": "Utility functions for formatting, parsing, and converting GBP money values.",
  "frontend/src/utils/imageFailureReason.ts": "Provides user-friendly messages for image load failures and pre-validates image URLs.",
  "frontend/src/utils/optionalEmail.ts": "Helpers for normalizing optional email fields for backend storage and UI display.",
  "frontend/src/utils/submitArtworkDraft.ts": "Manages loading, saving, and clearing artwork submission drafts in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and remove them when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Tracks project state, features, and new requests related to supporting private profile names and unique public site usernames."
}