{
  "backend/main.mo": "Defines the main canister with user, artist, artwork, submission, and inquiry types plus maps and helpers for public views and access control. Contains core business logic scaffolding with mapping structures and ID counters.",
  "backend/migration.mo": "Implements a no-op migration module mapping old actor state to the new one with identical types. Provides type aliases and a run function that returns the input unchanged.",
  "feature_evidence.json": "Empty feature evidence report placeholder containing no listed features.",
  "frontend-file-summaries.txt": "Aggregated text file containing prewritten summaries for multiple frontend files.",
  "frontend/index.css": "Global Tailwind base with OKLCH color variables for light and dark themes and foundational background/foreground styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, theme provider, profile setup context, and all app routes including admin-protected routes.",
  "frontend/src/components/admin/InquiriesTab.tsx": "Admin dashboard tab that fetches and displays all purchase inquiries in a table with artwork preview and buyer details.",
  "frontend/src/components/admin/ReplaceDatasetControl.tsx": "Admin control providing a destructive dialog-driven action to replace all stored data with demo data using a mutation hook.",
  "frontend/src/components/admin/SubmissionsTab.tsx": "Displays a table of artwork submissions with images, status badges, and actions to approve or reject each submission.",
  "frontend/src/components/artists/CreateArtistProfileForm.tsx": "Form for creating a new artist profile with validation, error handling, and success feedback.",
  "frontend/src/components/artists/EditArtistProfileForm.tsx": "Loads an existing artist profile and provides a form to edit and update profile fields with validation.",
  "frontend/src/components/artworks/EditArtworkForm.tsx": "Form for editing artwork details, updating images, and submitting changes with validation and preview support.",
  "frontend/src/components/artworks/SoldArtworkImage.tsx": "Wrapper around an artwork image that conditionally displays a SOLD watermark overlay.",
  "frontend/src/components/artworks/SoldWatermarkOverlay.tsx": "Displays a centered semi-transparent SOLD watermark overlay in various sizes.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin routes by enforcing authentication and admin permissions, showing appropriate alerts.",
  "frontend/src/components/auth/LoginButton.tsx": "Button that handles login and logout using Internet Identity with loading and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first‑time users to enter name, email, bio, and an optional avatar, then save their profile.",
  "frontend/src/components/auth/ProfileSetupProvider.tsx": "Context provider managing whether the profile‑setup modal is open.",
  "frontend/src/components/gallery/ArtworkCard.tsx": "Clickable artwork card showing image, artist, and price, with lightbox support.",
  "frontend/src/components/gallery/GalleryFilters.tsx": "Category and sort selectors for filtering artwork lists.",
  "frontend/src/components/images/ArtworkImage.tsx": "Image component that validates URLs and displays graceful error states on load failure.",
  "frontend/src/components/images/ArtworkLightbox.tsx": "Fullscreen lightbox dialog for viewing artwork images with optional sold watermark.",
  "frontend/src/components/inquiries/PurchaseInquiryDialog.tsx": "Dialog for submitting purchase inquiries, handling login, profile checks, and form submission.",
  "frontend/src/components/layout/SiteFooter.tsx": "Simple site footer with branding and external link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Site header with navigation, login button, user/admin links, and mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page wrapper including header, footer, and main content area.",
  "frontend/src/components/submissions/SubmissionConfirmation.tsx": "Displays a confirmation card for a submitted artwork, showing the submission ID and navigation options.",
  "frontend/src/components/submissions/SubmitArtworkForm.tsx": "Handles artwork submission with form fields, image upload, draft saving, artist profile checks, and submission mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminDashboard.ts": "Provides admin-focused hooks to fetch submissions and inquiries and approve or reject submissions.",
  "frontend/src/hooks/useArtists.ts": "Exposes hooks to fetch artist profiles, get caller's artist profile, and create or update artist profiles with cache invalidation.",
  "frontend/src/hooks/useArtworks.ts": "Fetches all artworks or a specific artwork by ID using the backend actor.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks for caller user profile management and admin authorization checks.",
  "frontend/src/hooks/useDeleteArtwork.ts": "Defines a mutation to delete an artwork and invalidate related queries.",
  "frontend/src/hooks/useEditArtwork.ts": "Provides a mutation for editing artwork details and triggers relevant cache invalidations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useMySubmissions.ts": "Fetches submissions by the logged‑in user using react-query and the actor API.",
  "frontend/src/hooks/usePurchaseInquiry.ts": "Sends a purchase inquiry mutation and invalidates inquiry-related queries on success.",
  "frontend/src/hooks/useReplaceDataset.ts": "Triggers a dataset replacement and invalidates all major data queries afterward.",
  "frontend/src/hooks/useSubmitArtwork.ts": "Submits new artwork via the actor API and refreshes artwork and submission queries.",
  "frontend/src/hooks/useToggleArtworkSoldStatus.ts": "Toggles an artwork's sold status and invalidates related artwork and inquiry queries.",
  "frontend/src/index.css": "Defines Tailwind layers and theme variables for light and dark modes, plus gallery styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin page showing dataset controls and tabs for submissions and purchase inquiries.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays an artist’s profile and artworks, with edit options for the profile owner.",
  "frontend/src/pages/ArtistsPage.tsx": "Lists all artists with bios and links to their profiles.",
  "frontend/src/pages/ArtworkDetailsPage.tsx": "Displays artwork details with purchase inquiries, owner controls, and sold/status actions.",
  "frontend/src/pages/CreateArtistProfilePage.tsx": "Page for creating an artist profile, prompting login if unauthenticated.",
  "frontend/src/pages/EditArtistProfilePage.tsx": "Allows authenticated users to edit their artist profile or prompts creation if missing.",
  "frontend/src/pages/EditArtworkPage.tsx": "Page for editing an artwork, handling auth, ownership checks, loading states, and rendering an edit form.",
  "frontend/src/pages/GalleryPage.tsx": "Displays all artworks with category and sort controls, showing loading, empty, or a grid of artwork cards.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero, features, and calls to action to explore the gallery or submit art.",
  "frontend/src/pages/MyProfilePage.tsx": "Profile editing page allowing users to update personal info and avatar with validation and save handling.",
  "frontend/src/pages/SubmitArtworkPage.tsx": "Artwork submission page enforcing login and profile completion, showing form or confirmation after submission.",
  "frontend/src/utils/fileToDataUrl.ts": "Converts an image File to a data URL with type and size validation.",
  "frontend/src/utils/gbpMoney.ts": "Utility for formatting, parsing, and converting GBP prices between decimal and minor units.",
  "frontend/src/utils/imageFailureReason.ts": "Functions that validate image URLs and provide readable error messages for load failures.",
  "frontend/src/utils/optionalEmail.ts": "Normalizes optional email fields for backend storage and form display.",
  "frontend/src/utils/submitArtworkDraft.ts": "Manages saving, loading, and clearing artwork submission drafts in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, storing them in sessionStorage, and retrieving or clearing persisted values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes project state, including admin authorization feature requests and notes about persistent artwork submissions and known issues."
}