{
  "backend/main.mo": "Main actor canister implementing user profiles, artist profiles, artworks, submissions, inquiries, and access‑controlled CRUD operations.",
  "backend/migration.mo": "Migration module converting old user profiles to the new format by adding a nullable avatar field.",
  "feature_evidence.json": "Feature evidence report describing avatar‑related profile updates and linking affected frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files across layout, pages, components, and styling.",
  "frontend/index.css": "Global Tailwind base styles and CSS variables defining the app’s light/dark color system.",
  "frontend/index.html": "Base HTML document bootstrapping the React app and loading main.tsx.",
  "frontend/src/App.tsx": "App entry defining TanStack Router routes, theme provider, and global layout with ProfileSetupModal.",
  "frontend/src/components/admin/InquiriesTab.tsx": "Admin tab listing purchase inquiries with artwork preview, buyer info, message, and date.",
  "frontend/src/components/admin/SubmissionsTab.tsx": "Displays all artwork submissions for admins with actions to approve or reject and includes image preview via lightbox.",
  "frontend/src/components/artists/CreateArtistProfileForm.tsx": "Provides a form for artists to create a profile with validation and success/error handling.",
  "frontend/src/components/artworks/EditArtworkForm.tsx": "Form for editing artwork details, updating images, and handling authorization and validation errors.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Guards admin routes by checking authentication and admin status, showing appropriate prompts or content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that handles Internet Identity authentication and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to complete their profile, including optional avatar upload.",
  "frontend/src/components/gallery/ArtworkCard.tsx": "Clickable artwork card displaying image, title, artist, and price with lightbox image preview support.",
  "frontend/src/components/gallery/GalleryFilters.tsx": "Provides category and sort dropdowns for the gallery, emitting changes via callbacks.",
  "frontend/src/components/images/ArtworkImage.tsx": "Displays an artwork image with URL validation, load error handling, and optional click support.",
  "frontend/src/components/images/ArtworkLightbox.tsx": "Full-screen dialog lightbox for viewing an artwork image with close controls.",
  "frontend/src/components/inquiries/PurchaseInquiryDialog.tsx": "Modal form for submitting a purchase inquiry, handling validation, submission, and success/error states.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying site credits and branding.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with navigation links, auth controls, and mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps pages with a header, footer, and full‑height layout structure.",
  "frontend/src/components/submissions/SubmissionConfirmation.tsx": "Displays a confirmation card after artwork submission with status and navigation actions.",
  "frontend/src/components/submissions/SubmitArtworkForm.tsx": "Form for submitting artwork with image upload, draft saving, validation, and profile checks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAdminDashboard.ts": "Provides hooks to fetch and manage artwork submissions and purchase inquiries, including approve/reject mutations with cache invalidation.",
  "frontend/src/hooks/useArtists.ts": "Hooks for fetching artist profiles, getting an artist by ID or caller, and creating new artist profiles with query updates.",
  "frontend/src/hooks/useArtworks.ts": "Hooks to fetch all artworks or a specific artwork by ID via the actor API.",
  "frontend/src/hooks/useAuthz.ts": "Handles user profile fetching/saving and admin authorization checks based on the caller identity.",
  "frontend/src/hooks/useDeleteArtwork.ts": "Mutation hook to delete an artwork and invalidate related artwork and submission queries.",
  "frontend/src/hooks/useEditArtwork.ts": "Mutation hook to edit artwork details and refresh related artwork and submission caches.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, identity loading, and an auth provider component.",
  "frontend/src/hooks/useMySubmissions.ts": "Fetches submissions belonging to the logged‑in caller, enabled only when identity and actor are available.",
  "frontend/src/hooks/usePurchaseInquiry.ts": "Mutation hook to create purchase inquiries and refresh inquiry-related queries.",
  "frontend/src/hooks/useSubmitArtwork.ts": "Mutation hook to submit new artwork and invalidate artwork and submission lists.",
  "frontend/src/index.css": "Tailwind layers and custom CSS variables defining light/dark themes and gallery-specific styles.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabbed views for managing submissions and purchase inquiries.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays artist details and lists artworks by the artist, with loading and not‑found states.",
  "frontend/src/pages/ArtistsPage.tsx": "Displays a list of artists with loading and empty states, showing cards linking to artist profiles.",
  "frontend/src/pages/ArtworkDetailsPage.tsx": "Shows detailed artwork info with image lightbox, purchase inquiry, and owner-only delete actions.",
  "frontend/src/pages/EditArtworkPage.tsx": "Provides an artwork edit form with authentication and ownership checks, handling load and error states.",
  "frontend/src/pages/GalleryPage.tsx": "Displays the artwork gallery with filtering, sorting, and loading states using ArtworkCard components.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero, features, and CTA sections linking to gallery and submission pages.",
  "frontend/src/pages/MyProfilePage.tsx": "User profile editor with avatar upload, form validation, and save handling requiring authentication.",
  "frontend/src/pages/SubmitArtworkPage.tsx": "Page for submitting new artwork, showing a confirmation after successful submission and clearing drafts.",
  "frontend/src/utils/fileToDataUrl.ts": "Converts image files to data URLs with type and size validation.",
  "frontend/src/utils/gbpMoney.ts": "Utility functions for formatting, parsing, and converting GBP monetary values.",
  "frontend/src/utils/imageFailureReason.ts": "Provides functions to validate image URLs and generate user-friendly error messages for invalid or failed image loads.",
  "frontend/src/utils/submitArtworkDraft.ts": "Handles saving, loading, and clearing artwork submission drafts in sessionStorage with basic structure validation.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based query values.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, animations, and plugins like typography and container queries.",
  "project_state.json": "Stores project metadata, including features, requests, known issues, and architectural notes."
}