{
  "backend/main.mo": "Motoko canister implementing user profiles, artist profiles, artwork submissions, and purchase inquiries with access control enforced. Maintains in‑memory maps and exposes CRUD-style query and update methods.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to the frontend files they modify, along with component dependencies and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend React component, page, and utility file in the project.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark mode, including OKLCH color tokens and global styling resets.",
  "frontend/index.html": "Basic HTML root document that loads the React app by mounting main.tsx into the #root element.",
  "frontend/src/App.tsx": "Main app router setup using TanStack Router with theme provider, global layout, route definitions, and admin route guarding.",
  "frontend/src/components/admin/InquiriesTab.tsx": "Admin dashboard table displaying purchase inquiries with artwork thumbnails, buyer information, messages, and timestamps.",
  "frontend/src/components/admin/SubmissionsTab.tsx": "Displays artwork submissions for admins with image preview, status badges, and approve/reject actions.",
  "frontend/src/components/artists/CreateArtistProfileForm.tsx": "Form for artists to create a profile with validation and success/error handling.",
  "frontend/src/components/artworks/EditArtworkForm.tsx": "Form allowing artists to edit artwork details, replace images, and submit updates with validation.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Guards admin routes by checking authentication and admin permissions, showing appropriate prompts or content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and automatic retry handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to complete their profile with a simple form.",
  "frontend/src/components/gallery/ArtworkCard.tsx": "Displays a clickable artwork card with image lightbox, title, artist, and price.",
  "frontend/src/components/gallery/GalleryFilters.tsx": "Filter component for selecting artwork category and sorting by price or recency.",
  "frontend/src/components/images/ArtworkImage.tsx": "Image component that validates URLs, handles loading and error states, and supports click-to-open interactions.",
  "frontend/src/components/images/ArtworkLightbox.tsx": "Fullscreen dialog-based lightbox for displaying an artwork image with close controls.",
  "frontend/src/components/inquiries/PurchaseInquiryDialog.tsx": "Dialog form for submitting a purchase inquiry, with validation, success state, and error handling.",
  "frontend/src/components/layout/SiteFooter.tsx": "Simple site footer showing copyright info and branding link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation, logo, admin link, login button, and mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper that renders header, footer, and main content region.",
  "frontend/src/components/submissions/SubmissionConfirmation.tsx": "Displays a confirmation card after artwork submission with actions to submit again or view the gallery.",
  "frontend/src/components/submissions/SubmitArtworkForm.tsx": "Form for submitting artwork including image upload, validation, artist profile checks, and submission handling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdminDashboard.ts": "Admin dashboard hooks for fetching submissions and inquiries and approving or rejecting submissions.",
  "frontend/src/hooks/useArtists.ts": "Provides React Query hooks to fetch all artists, fetch an artist by ID, get the caller's artist profile, and create a new artist profile.",
  "frontend/src/hooks/useArtworks.ts": "Provides hooks to fetch all artworks or a specific artwork by ID using the actor API.",
  "frontend/src/hooks/useAuthz.ts": "Handles fetching and saving the caller's user profile and checking admin authorization via actor methods.",
  "frontend/src/hooks/useEditArtwork.ts": "Defines a mutation for editing artwork details and invalidates related queries after updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an identity provider and hook for managing Internet Identity login, storage, and state.",
  "frontend/src/hooks/useMySubmissions.ts": "Fetches artwork submissions created by the current authenticated user.",
  "frontend/src/hooks/usePurchaseInquiry.ts": "Mutation hook to create a purchase inquiry and refresh inquiry-related data.",
  "frontend/src/hooks/useSubmitArtwork.ts": "Defines a mutation for submitting new artwork and invalidates artwork and submission queries on success.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme colors, dark mode, and gallery-related utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for managing submissions and purchase inquiries.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays an artist's profile and their artworks, handling loading and not-found states.",
  "frontend/src/pages/ArtistsPage.tsx": "Lists all artists with cards and provides navigation to individual artist profiles.",
  "frontend/src/pages/ArtworkDetailsPage.tsx": "Displays artwork details, handles loading states, owner checks, lightbox, and purchase inquiry dialog.",
  "frontend/src/pages/EditArtworkPage.tsx": "Provides an artwork editing form with authentication, ownership checks, and navigation handling.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a filterable and sortable gallery of artworks with loading and empty states.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero, features, and calls to action for exploring or submitting art.",
  "frontend/src/pages/SubmitArtworkPage.tsx": "Displays the artwork submission form and shows a confirmation after successful submission.",
  "frontend/src/utils/fileToDataUrl.ts": "Converts an image file to a data URL with type and size validation.",
  "frontend/src/utils/gbpMoney.ts": "Formats, parses, and converts GBP price values between display strings and minor units.",
  "frontend/src/utils/imageFailureReason.ts": "Validates image URLs and provides user-friendly error messages for load failures.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, and container settings, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing the project’s current state, including schema version, feature list, architectural notes, and overall goals for the Z'art gallery website."
}