{
  "backend/main.mo": "Main Motoko actor defining user, artist, artwork, submission, and inquiry types with maps for storage plus profile management and access‑controlled operations.",
  "backend/migration.mo": "Migration module that defines legacy data structures and returns old state unchanged during upgrades.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend files and components for reference.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Basic HTML shell mounting the root div and loading the React entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, layout, and profile setup modal for the app.",
  "frontend/src/components/admin/InquiriesTab.tsx": "Admin table view displaying purchase inquiries with artwork preview, buyer info, message, and date.",
  "frontend/src/components/admin/ReplaceDatasetControl.tsx": "Admin control with confirmation dialog to wipe all data and replace it using demo dataset.",
  "frontend/src/components/admin/SubmissionsTab.tsx": "Displays artwork submissions in a table with status, image preview, and approve/reject actions using admin hooks.",
  "frontend/src/components/artists/CreateArtistProfileForm.tsx": "Form for creating an artist profile with validation, error handling, and success messaging.",
  "frontend/src/components/artworks/EditArtworkForm.tsx": "Form to edit artwork details and optionally replace the image, with validation and authorization-aware error handling.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Guards admin routes by checking authentication and admin permissions, showing appropriate alerts or content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading state and automatic error recovery.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to complete their profile, including optional avatar upload and form validation.",
  "frontend/src/components/gallery/ArtworkCard.tsx": "Displays an artwork card with image, title, artist, and price, supporting lightbox preview and navigation to detail view.",
  "frontend/src/components/gallery/GalleryFilters.tsx": "No summary available.",
  "frontend/src/components/images/ArtworkImage.tsx": "Displays artwork images with URL validation, error handling, loading state, and optional click behavior.",
  "frontend/src/components/images/ArtworkLightbox.tsx": "Full-screen dialog lightbox for viewing an artwork image with close controls.",
  "frontend/src/components/inquiries/PurchaseInquiryDialog.tsx": "Dialog form for submitting purchase inquiries with validation, loading states, and success messaging.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with branding and external link attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation links, login button, mobile menu, and admin/profile shortcuts.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper that includes header, footer, and main content area.",
  "frontend/src/components/submissions/SubmissionConfirmation.tsx": "Confirmation card shown after artwork submission with submission ID and navigation options.",
  "frontend/src/components/submissions/SubmitArtworkForm.tsx": "Artwork submission form with image upload, drafts, validation, profile checks, and submission handling.",
  "frontend/src/hooks/useActor.ts": "Manages authenticated or anonymous backend actor creation and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useAdminDashboard.ts": "Hooks for fetching and managing artwork submissions and purchase inquiries, including approve and reject mutations.",
  "frontend/src/hooks/useArtists.ts": "Provides hooks to fetch artist profiles, get an artist by ID, fetch the caller’s profile, and create new artist profiles.",
  "frontend/src/hooks/useArtworks.ts": "Hooks to retrieve all artworks or a specific artwork by ID from the backend actor.",
  "frontend/src/hooks/useAuthz.ts": "Handles user profile retrieval, saving, and checking if the caller is an admin.",
  "frontend/src/hooks/useDeleteArtwork.ts": "Mutation hook for deleting artwork and invalidating related queries.",
  "frontend/src/hooks/useEditArtwork.ts": "Mutation hook for editing artwork details and refreshing dependent caches.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity persistence.",
  "frontend/src/hooks/useMySubmissions.ts": "Fetches artwork submissions created by the current authenticated user.",
  "frontend/src/hooks/usePurchaseInquiry.ts": "Mutation hook to submit a purchase inquiry and refresh inquiry data.",
  "frontend/src/hooks/useReplaceDataset.ts": "Mutation hook that triggers a dataset reset and invalidates all major data queries.",
  "frontend/src/hooks/useSubmitArtwork.ts": "Mutation hook to submit new artwork and refresh artwork and submission lists.",
  "frontend/src/index.css": "Tailwind CSS configuration defining themes, colors, and layout utilities for the UI.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering the app.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard UI with tabs for submissions, inquiries, and dataset replacement.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays an artist’s profile and filters artworks belonging to that artist.",
  "frontend/src/pages/ArtistsPage.tsx": "Displays a list of artists with cards, loading states, and navigation to artist profiles.",
  "frontend/src/pages/ArtworkDetailsPage.tsx": "Shows detailed artwork info, owner controls, purchase inquiry, image lightbox, and delete handling.",
  "frontend/src/pages/EditArtworkPage.tsx": "Provides an edit form for artwork with authentication, ownership checks, and navigation helpers.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a gallery of artworks with filtering, sorting, and loading states.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero, feature sections, and navigation to gallery or submission page.",
  "frontend/src/pages/MyProfilePage.tsx": "Allows authenticated users to view and edit their profile, including avatar upload and validation.",
  "frontend/src/pages/SubmitArtworkPage.tsx": "Provides an artwork submission form and shows confirmation after successful submission.",
  "frontend/src/utils/fileToDataUrl.ts": "Converts an image file to a data URL with type and size validation.",
  "frontend/src/utils/gbpMoney.ts": "Utility functions for formatting, parsing, and converting GBP values between display and minor units.",
  "frontend/src/utils/imageFailureReason.ts": "Provides functions to validate image URLs and generate user-friendly error messages for image load failures.",
  "frontend/src/utils/submitArtworkDraft.ts": "Manages saving, loading, and clearing artwork submission drafts in sessionStorage with basic structure validation.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, animations, and plugins for styling the frontend.",
  "project_state.json": "Stores project metadata including schema version, architectural notes, issues, and lists of existing and requested features."
}