{
  "backend/main.mo": "Main canister implementing user profiles, artist data, artworks, submissions, inquiries, and permission‑checked CRUD operations.",
  "backend/migration.mo": "Migration module that transfers all stored maps and counters unchanged from old to new state.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference.",
  "frontend/index.css": "Tailwind base file defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Base HTML page with root mount point loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, routes, layout, and theme provider for the frontend app.",
  "frontend/src/components/admin/InquiriesTab.tsx": "Admin table view listing all purchase inquiries with artwork info and buyer details.",
  "frontend/src/components/admin/ReplaceDatasetControl.tsx": "Admin control that triggers dataset replacement with confirmation dialog and status handling.",
  "frontend/src/components/admin/SubmissionsTab.tsx": "Displays a table of artwork submissions with image previews and actions to approve or reject each submission.",
  "frontend/src/components/artists/CreateArtistProfileForm.tsx": "Form for creating an artist profile with validation, success messaging, and optional callback on completion.",
  "frontend/src/components/artworks/EditArtworkForm.tsx": "Form for editing artwork details and optionally updating the image, with validation and error handling.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Guards admin routes by checking authentication and admin status, rendering appropriate messages or children.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and automatic retry handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to complete their profile, including optional avatar upload and validation.",
  "frontend/src/components/gallery/ArtworkCard.tsx": "Displays an artwork preview card with image lightbox and navigation to the artwork detail page.",
  "frontend/src/components/gallery/GalleryFilters.tsx": "Provides category and sort dropdown controls for filtering gallery items.",
  "frontend/src/components/images/ArtworkImage.tsx": "Displays artwork images with loading, validation, and graceful error handling.",
  "frontend/src/components/images/ArtworkLightbox.tsx": "Full-screen dialog lightbox for viewing artwork images with close controls.",
  "frontend/src/components/inquiries/PurchaseInquiryDialog.tsx": "Modal form for submitting purchase inquiries with validation and success/error states.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with branding and a link to caffeine.ai.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header with navigation, authentication controls, and responsive mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps pages with a header, footer, and main content layout.",
  "frontend/src/components/submissions/SubmissionConfirmation.tsx": "Displays a confirmation card after artwork submission with navigation options.",
  "frontend/src/components/submissions/SubmitArtworkForm.tsx": "Form for submitting new artwork with image upload, draft saving, and validation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, reloading on identity changes.",
  "frontend/src/hooks/useAdminDashboard.ts": "Provides React Query hooks for fetching and managing submissions and purchase inquiries, including approve/reject actions with cache invalidation.",
  "frontend/src/hooks/useArtists.ts": "Supplies hooks to fetch all artists, fetch a specific artist, get the caller's artist profile, and create a new profile with appropriate cache updates.",
  "frontend/src/hooks/useArtworks.ts": "Contains hooks to fetch all artworks or a specific artwork by ID using the actor API.",
  "frontend/src/hooks/useAuthz.ts": "Implements hooks for retrieving and saving the caller’s user profile and checking admin authorization.",
  "frontend/src/hooks/useDeleteArtwork.ts": "Defines a mutation for deleting an artwork and invalidates related queries on success.",
  "frontend/src/hooks/useEditArtwork.ts": "Provides a mutation to edit artwork details and refreshes related artwork and submission queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and identity persistence via a React context provider.",
  "frontend/src/hooks/useMySubmissions.ts": "Fetches artwork submissions belonging to the current authenticated user.",
  "frontend/src/hooks/usePurchaseInquiry.ts": "Offers a mutation to submit a purchase inquiry and invalidates inquiry-related queries afterward.",
  "frontend/src/hooks/useReplaceDataset.ts": "Runs a dataset replacement mutation and invalidates all major data queries to refresh the app.",
  "frontend/src/hooks/useSubmitArtwork.ts": "Provides a mutation for submitting new artwork and updates artwork and submission queries on success.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for theming, plus layout utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for submissions, inquiries, and dataset replacement.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays an artist’s profile and filters artworks belonging to that artist, with navigation and loading states.",
  "frontend/src/pages/ArtistsPage.tsx": "Displays a list of artists with loading and empty states, each linking to an artist profile.",
  "frontend/src/pages/ArtworkDetailsPage.tsx": "Shows detailed artwork info with image lightbox, owner actions, and purchase inquiry flow.",
  "frontend/src/pages/EditArtworkPage.tsx": "Provides an authenticated, owner‑only form to edit artwork details with loading and error states.",
  "frontend/src/pages/GalleryPage.tsx": "Renders the main gallery with filtering, sorting, and loading behavior for artworks.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero, features, and navigation CTAs to explore or submit artwork.",
  "frontend/src/pages/MyProfilePage.tsx": "Allows authenticated users to view and update profile info and avatar with validation and save handling.",
  "frontend/src/pages/SubmitArtworkPage.tsx": "Shows a submission form for new artwork and displays confirmation after successful submission.",
  "frontend/src/utils/fileToDataUrl.ts": "Converts an image file to a data URL with type and size validation.",
  "frontend/src/utils/gbpMoney.ts": "Utility functions for formatting, parsing, and converting GBP monetary values.",
  "frontend/src/utils/imageFailureReason.ts": "Provides functions to validate image URLs and return user-friendly error messages for invalid or failed image loads.",
  "frontend/src/utils/submitArtworkDraft.ts": "Implements sessionStorage-based save, load, and clear operations for artwork submission drafts with basic structure validation.",
  "frontend/src/utils/urlParams.ts": "Offers utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing values.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom themes, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes project requirements for implementing stable storage, automatic upgrade migration, and persistence of user and upload data across canister upgrades."
}