{
  "backend/main.mo": "Defines user, artist, artwork, submission, and inquiry types with maps for storage and includes access-controlled CRUD for profiles, submissions, and inquiries.",
  "feature_evidence.json": "Lists feature evidence entries linking features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose of various frontend files across pages, components, and hooks.",
  "frontend/index.css": "Defines global Tailwind layers and CSS variables for light and dark themes using an OKLCH-based palette.",
  "frontend/index.html": "Basic HTML entry point mounting the React app at #root and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global layout, theme provider, profile setup context, and admin route protection.",
  "frontend/src/components/admin/InquiriesTab.tsx": "Renders an admin table of all purchase inquiries with loading state, empty state, artwork info, buyer details, and timestamps.",
  "frontend/src/components/admin/ReplaceDatasetControl.tsx": "Provides a destructive admin control that opens a confirmation dialog and triggers dataset replacement via a mutation with toast notifications.",
  "frontend/src/components/admin/SubmissionsTab.tsx": "Displays all artwork submissions with status badges, image previews, and admin actions to approve or reject each submission.",
  "frontend/src/components/artists/CreateArtistProfileForm.tsx": "Form for creating an artist profile with validation, submission handling, and success or error messaging.",
  "frontend/src/components/artworks/EditArtworkForm.tsx": "Form for editing artwork details including title, description, price, and optional image replacement with preview and error handling.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Guards admin-only routes by checking authentication and admin permissions, showing appropriate redirects or alerts.",
  "frontend/src/components/auth/LoginButton.tsx": "Button that handles login and logout via Internet Identity with loading and error handling states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal shown to new users for completing profile setup, including name, email, bio, and optional avatar upload.",
  "frontend/src/components/auth/ProfileSetupProvider.tsx": "Provides a React context for opening and closing the profile setup modal and a hook to access it.",
  "frontend/src/components/gallery/ArtworkCard.tsx": "Displays an artwork card with image, details, navigation to artwork page, and a lightbox for enlarging the image.",
  "frontend/src/components/gallery/GalleryFilters.tsx": "Renders category and sorting dropdowns for filtering and ordering gallery artwork.",
  "frontend/src/components/images/ArtworkImage.tsx": "Reusable image component that validates URLs, handles load failures, and displays fallback UI while preserving layout.",
  "frontend/src/components/images/ArtworkLightbox.tsx": "Full‑screen lightbox dialog for viewing artwork images with close controls.",
  "frontend/src/components/inquiries/PurchaseInquiryDialog.tsx": "Dialog for submitting purchase inquiries, handling authentication, profile checks, form submission, and success/error states.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying branding text and a link to caffeine.ai.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header with navigation links, login button, admin/profile options, and a mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper including header, footer, and main content area.",
  "frontend/src/components/submissions/SubmissionConfirmation.tsx": "Displays a confirmation card after artwork submission with submission details and navigation options.",
  "frontend/src/components/submissions/SubmitArtworkForm.tsx": "Form component for submitting artwork including image upload, draft saving, validation, and conditional artist profile creation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor based on identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdminDashboard.ts": "Provides admin-side hooks to fetch submissions and inquiries and to approve or reject submissions with cache updates.",
  "frontend/src/hooks/useArtists.ts": "Hooks for listing artists, fetching artist profiles, and creating new artist profiles with automatic cache invalidation.",
  "frontend/src/hooks/useArtworks.ts": "Hooks to fetch all artworks or a specific artwork using the backend actor.",
  "frontend/src/hooks/useAuthz.ts": "Hooks for user profile retrieval, saving profiles, and checking admin authorization with identity-based gating.",
  "frontend/src/hooks/useDeleteArtwork.ts": "Mutation hook to delete an artwork and invalidate related caches.",
  "frontend/src/hooks/useEditArtwork.ts": "Mutation hook to edit artwork fields and refresh artwork and submission caches.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, logout, and persisted identity state.",
  "frontend/src/hooks/useMySubmissions.ts": "Fetches submissions created by the logged-in user using the backend actor.",
  "frontend/src/hooks/usePurchaseInquiry.ts": "Mutation hook to create a purchase inquiry and refresh related query data.",
  "frontend/src/hooks/useReplaceDataset.ts": "Mutation hook to reset backend data and invalidate all major data queries.",
  "frontend/src/hooks/useSubmitArtwork.ts": "Mutation hook to submit new artwork and refresh artwork and submissions caches.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables and custom utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders admin dashboard with dataset controls and tabs for submissions and inquiries.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays artist details and lists artworks filtered by artist ID.",
  "frontend/src/pages/ArtistsPage.tsx": "Lists all artists with website links and profile navigation.",
  "frontend/src/pages/ArtworkDetailsPage.tsx": "Shows artwork details with inquiry, delete, and lightbox actions and ownership checks.",
  "frontend/src/pages/EditArtworkPage.tsx": "Allows authenticated owners to edit artwork and handles permissions and loading states.",
  "frontend/src/pages/GalleryPage.tsx": "Displays artwork grid with filtering, sorting, and loading states.",
  "frontend/src/pages/HomePage.tsx": "Home landing page with hero section, features, and navigation CTAs.",
  "frontend/src/pages/MyProfilePage.tsx": "Profile management page allowing users to edit details, upload/remove avatars, and save changes using auth and backend hooks.",
  "frontend/src/pages/SubmitArtworkPage.tsx": "Artwork submission page that enforces authentication and profile completion, renders the submission form, and shows confirmation.",
  "frontend/src/utils/fileToDataUrl.ts": "Converts image files to data URLs with validation for type and size.",
  "frontend/src/utils/gbpMoney.ts": "Utility functions for formatting, parsing, and converting GBP amounts between decimal and minor units.",
  "frontend/src/utils/imageFailureReason.ts": "Determines user-friendly image load error messages and validates image URLs.",
  "frontend/src/utils/optionalEmail.ts": "Normalizes optional email fields for backend storage and form display.",
  "frontend/src/utils/submitArtworkDraft.ts": "Manages saving, loading, and clearing artwork submission drafts in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Utilities for retrieving, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Defines current project state, listing existing and pending features about public gallery access, profile gating, and an artist-listing bug. Includes architectural notes, known issues, and version metadata."
}