{
  "kind": "build_request",
  "title": "Make gallery public; require profile only for uploads and interactions",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Allow all gallery browsing flows to work without requiring authentication or a completed user profile, including: viewing the Gallery page, viewing an Artwork details page, viewing the Artists list, and viewing an individual Artist profile page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-6"
        ],
        "quotes": [
          "All gallery content viewable without a profile. Profile needed for uploading content and interactions."
        ]
      },
      "acceptanceCriteria": [
        "A signed-out (anonymous) user can visit /gallery and see artworks without being prompted to create a profile.",
        "A signed-out (anonymous) user can open /artwork/:artworkId and view all artwork details without being prompted to create a profile.",
        "A signed-out (anonymous) user can visit /artists and /artist/:artistId and view artist information without being prompted to create a profile.",
        "An authenticated user who has not created a user profile is not blocked by any profile setup modal while browsing /gallery, /artwork/:artworkId, /artists, or /artist/:artistId."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Change the profile setup gating so that the profile setup modal is not shown globally during normal browsing; instead, require a completed user profile only at the point of restricted actions (uploading content and interactions).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-6"
        ],
        "quotes": [
          "Profile needed for uploading content and interactions."
        ]
      },
      "acceptanceCriteria": [
        "The profile setup modal does not automatically open site-wide just because an authenticated user lacks a profile.",
        "When an authenticated user without a profile navigates to /submit, the UI blocks submission and clearly indicates they must complete their profile (existing behavior can remain, but must not rely on a site-wide forced modal).",
        "The app still supports completing the user profile via the existing profile setup UI, using English user-facing text."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Require a completed user profile for interaction flows in the artwork experience (at minimum: submitting a purchase inquiry). If a user is not authenticated or has no profile, the UI must prevent the interaction and prompt them to log in and/or complete their profile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-6"
        ],
        "quotes": [
          "Profile needed for uploading content and interactions."
        ]
      },
      "acceptanceCriteria": [
        "From an artwork detail page, a signed-out user cannot submit a purchase inquiry; the UI prompts them to log in first.",
        "From an artwork detail page, an authenticated user without a profile cannot submit a purchase inquiry; the UI prompts them to complete their profile first.",
        "An authenticated user with a completed profile can submit a purchase inquiry successfully (no regression)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Fix the issue where the Artists page does not list all expected artists by ensuring the frontend always renders the full set of artists returned by the backend and by resolving any filtering/caching logic that could cause the list to appear incomplete.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-3"
        ],
        "quotes": [
          "Not all artists are listed"
        ]
      },
      "acceptanceCriteria": [
        "/artists displays all artist profiles returned by the backend call that powers the Artists page.",
        "Refreshing the page or navigating away/back does not cause the Artists list to drop entries unexpectedly.",
        "If the backend returns N artists, the UI renders N artist cards (unless intentionally paginated, which is not required here)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only).",
    "Do not modify immutable frontend hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration.mo if a state upgrade is required."
  ],
  "nonGoals": [
    "Adding new interaction types (likes, comments, follows) beyond gating the existing interaction flow(s).",
    "Changing backend authorization rules for public reads (artworks/artists) unless required to make public viewing work.",
    "Adding third-party authentication providers (only Internet Identity is supported)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}