{
  "kind": "build_request",
  "title": "Implement stable-memory persistence for users, artists, artworks, submissions, inquiries, and ID counters",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Add full upgrade-safe stable-memory persistence to the backend canister so that user profiles, artist profiles, artworks, submissions, purchase inquiries, and all ID counters survive canister upgrades (no data loss on redeploy/upgrade).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Full stable memory persistence system implemented"
        ]
      },
      "acceptanceCriteria": [
        "After an upgrade, previously created user profiles are still returned by getCallerUserProfile/getUserProfile.",
        "After an upgrade, previously created artist profiles are still returned by getArtistProfiles/getArtistProfileByCaller.",
        "After an upgrade, previously created artworks are still returned by getArtworks/getArtworkById.",
        "After an upgrade, previously created submissions and inquiries are still returned by the relevant admin and caller query methods.",
        "After an upgrade, nextArtworkId/nextSubmissionId/nextInquiryId continue from their pre-upgrade values (no ID reuse)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Implement upgrade-safe serialization/deserialization for the in-memory Maps in backend/main.mo by writing their contents (and counters) to stable variables during preupgrade and restoring them during postupgrade (or an equivalent stable rehydration pattern).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Full stable memory persistence system implemented"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo defines stable variables that can represent the full contents of: userProfiles, artistProfiles, artworks, submissions, inquiries, plus nextArtworkId/nextSubmissionId/nextInquiryId.",
        "System preupgrade writes a complete snapshot of the current in-memory state into the stable variables.",
        "System postupgrade reconstructs the in-memory Maps and counters from the stable snapshot.",
        "If the stable snapshot is absent/empty (fresh install), the canister initializes cleanly with empty Maps and counters starting at 1."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add a schema/version guard for the stable state and a conditional migration path inside backend/main.mo so future state-shape changes can be introduced without breaking upgrades, while preserving existing deployed state (including the nullable avatar field on user profiles).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Full stable memory persistence system implemented"
        ]
      },
      "acceptanceCriteria": [
        "A stable schema/version marker exists and is checked during upgrade restore.",
        "When the stored schema/version is older than the current schema/version, the code performs a conditional migration that preserves existing data and initializes any new stable fields safely.",
        "UserProfile.avatar remains nullable (?Text) throughout persistence and any migration logic (no traps due to missing avatar)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in backend/main.mo.",
    "All user-facing/trap/error strings introduced or modified must be in English.",
    "Do not modify frontend immutable paths (as listed in SYSTEM_CONTEXT.frontend.immutablePaths)."
  ],
  "nonGoals": [
    "Recovering user profiles and artworks that were already lost in a previous upgrade before stable persistence existed (those bytes are not available anymore).",
    "Adding new frontend features or changing UI flows unrelated to persistence."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}