{
  "kind": "build_request",
  "title": "Add profile avatar image upload and display",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the backend user profile model to store an optional avatar image and include it in all user profile read/write APIs.\n\nContext: backend/main.mo currently defines UserProfile as { name; email; bio } and exposes getCallerUserProfile, getUserProfile, and saveCallerUserProfile.\n\nImplementation requirements:\n- Add an optional field on UserProfile for the avatar image (e.g., a data URL string) so users can have no avatar.\n- Update the Candid interface accordingly so the frontend generated types include the new field.\n- Ensure getCallerUserProfile/getUserProfile return the avatar value and saveCallerUserProfile persists it.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Allow users to add an avatar or image on profile"
        ]
      },
      "acceptanceCriteria": [
        "Backend UserProfile type includes an optional avatar field and compiles successfully.",
        "saveCallerUserProfile accepts and stores the avatar field (including null/no avatar).",
        "getCallerUserProfile and getUserProfile return the stored avatar value unchanged.",
        "Existing authorization behavior for profile APIs remains unchanged."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the profile setup modal to allow selecting, previewing, and saving an optional avatar image as part of the initial profile creation.\n\nContext: frontend/src/components/auth/ProfileSetupModal.tsx currently collects name, email, and bio.\n\nImplementation requirements:\n- Add an avatar image input (file picker) that accepts images.\n- Use the existing helper frontend/src/utils/fileToDataUrl.ts to convert the selected file into a data URL string and store it in the form state.\n- Show a preview of the selected avatar image.\n- Provide a clear/remove avatar control to unset the selected avatar before submitting.\n- On submit, call the existing save profile mutation with the new avatar field included.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Allow users to add an avatar or image on profile"
        ]
      },
      "acceptanceCriteria": [
        "Profile setup modal allows choosing an image file and shows a preview.",
        "Invalid file types and files over 5MB show a user-friendly error (using existing fileToDataUrl validations).",
        "User can remove an ընտ avatar selection before saving.",
        "Submitting the modal successfully persists the avatar together with name/email/bio."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the My Profile page to display the current avatar and allow users to add, change, or remove their avatar image.\n\nContext: frontend/src/pages/MyProfilePage.tsx currently supports viewing/editing name, email, and bio.\n\nImplementation requirements:\n- Render the current avatar (if present) near the top of the profile card.\n- Add an image file picker to change the avatar; use frontend/src/utils/fileToDataUrl.ts.\n- Add a remove avatar action that clears the avatar and saves the updated profile.\n- Ensure the Save Changes flow correctly enables/disables based on dirty state and shows success/error states consistently with existing behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Allow users to add an avatar or image on profile"
        ]
      },
      "acceptanceCriteria": [
        "If a user has an avatar saved, it is displayed on My Profile.",
        "User can upload a new avatar image, preview it, and save it; after save, the avatar persists on refresh.",
        "User can remove the avatar and save; after save, the avatar no longer displays and remains removed on refresh.",
        "All avatar upload errors are shown as English user-facing text and do not break the existing profile edit flow."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not modify files under frontend/src/components/ui or any other immutable paths listed in SYSTEM_CONTEXT.",
    "No external databases or third-party storage integrations; avatar must be stored using existing project capabilities."
  ],
  "nonGoals": [
    "Implementing image CDN hosting, chunked uploads, or server-side image resizing.",
    "Adding avatar support to artist profiles or artwork submissions unless required for profile avatar functionality.",
    "Adding third-party authentication providers (only Internet Identity is supported)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}