{
  "kind": "build_request",
  "title": "Grant caller admin review permissions (no UI)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a canister-level admin authorization mechanism that allows the user to become an admin with full review permissions (approve/reject artwork submissions) without adding any new admin-management UI.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-11",
          "msg-12",
          "msg-13",
          "msg-14"
        ],
        "quotes": [
          "Make me admin",
          "1 yes\n2 full review permissions \n3 no",
          "Great — I’ll add your Internet Identity principal to the canister’s admins list and give admins full review permissions, with no new UI required.",
          "Proceed"
        ]
      },
      "acceptanceCriteria": [
        "After the update is deployed, the user can log in with Internet Identity and is recognized as an admin by the backend (e.g., `isCallerAdmin()` returns true for that identity).",
        "Admin-only backend operations for reviewing submissions (e.g., approve/reject and viewing all submissions) succeed for the admin and are rejected for non-admins.",
        "No new frontend pages, buttons, or admin-management UI are added."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure admin authorization state persists across canister upgrades so that admin access is not lost on redeploy.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Pending review artworks are stored in the canister’s `submissions` map."
        ]
      },
      "acceptanceCriteria": [
        "Admin status remains intact after an upgrade/redeploy (no need to re-bootstrap admin access).",
        "If a state migration is required due to schema/state changes, provide it using the project’s conditional migration policy; otherwise, do not add a migration."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in `backend/main.mo` (per project architecture).",
    "Do not add or require any new admin-management UI (per user request).",
    "Do not modify files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui` (immutable paths)."
  ],
  "nonGoals": [
    "Restoring previously uploaded artwork that was not persisted in Version 27/28.",
    "Adding a UI to manage admins (add/remove/list admins).",
    "Adding additional admin powers beyond full review permissions for artwork submissions unless already present."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}