{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Public gallery browsing with profile-gated uploads and interactions",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make all gallery browsing routes accessible without authentication or a completed profile by removing global profile gating during normal browsing.",
      "acceptanceCriteria": [
        "A signed-out (anonymous) user can visit /gallery and see artworks without being prompted to create a profile.",
        "A signed-out (anonymous) user can open /artwork/:artworkId and view all artwork details without being prompted to create a profile.",
        "A signed-out (anonymous) user can visit /artists and /artist/:artistId and view artist information without being prompted to create a profile.",
        "An authenticated user who has not created a user profile is not blocked by any profile setup modal while browsing /gallery, /artwork/:artworkId, /artists, or /artist/:artistId."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the site-wide auto-opening ProfileSetupModal from the root layout so browsing routes are never blocked by profile setup; instead wire in a controlled, on-demand profile setup provider/controller component. Use the selected \"authorization\" component’s frontend patterns for detecting authentication/profile presence. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/ProfileSetupProvider.tsx",
          "operation": "create",
          "description": "Add a small context/provider that owns the profile-setup dialog open state and exposes an on-demand action (e.g., openProfileSetup()) that restricted flows can call, without affecting public browsing. Use the selected \"authorization\" component’s frontend guidance for profile fetching state (avoid modal flash) and cache-clearing expectations on logout. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Change profile setup gating so the profile setup UI is invoked only when attempting restricted actions (submission/upload), not globally during browsing.",
      "acceptanceCriteria": [
        "The profile setup modal does not automatically open site-wide just because an authenticated user lacks a profile.",
        "When an authenticated user without a profile navigates to /submit, the UI blocks submission and clearly indicates they must complete their profile (existing behavior can remain, but must not rely on a site-wide forced modal).",
        "The app still supports completing the user profile via the existing profile setup UI, using English user-facing text."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Refactor the existing ProfileSetupModal so it can be opened in a controlled/on-demand way (accept open state and completion callbacks from a parent controller) rather than auto-opening globally when userProfile is null. Keep English user-facing text. Use the selected \"authorization\" component’s recommended logic for combining actor readiness + identity + query fetch state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SubmitArtworkPage.tsx",
          "operation": "modify",
          "description": "Update /submit gating to block submission only at this route: if authenticated and profile is missing, show a clear call-to-action to complete the profile and trigger the on-demand profile setup flow (via the new provider/controller) instead of relying on a global forced modal. Use the selected \"authorization\" component patterns for profile checks and for handling authenticated-without-profile state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/MyProfilePage.tsx",
          "operation": "modify",
          "description": "Adjust the 'profile missing' state messaging so it no longer claims the modal will appear automatically; provide a clear action to complete profile (open the on-demand profile setup flow or otherwise direct the user to completion using existing UI). Use the selected \"authorization\" component’s profile setup expectations. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Gate artwork interactions (purchase inquiry) behind login + completed profile, prompting users appropriately before allowing submission.",
      "acceptanceCriteria": [
        "From an artwork detail page, a signed-out user cannot submit a purchase inquiry; the UI prompts them to log in first.",
        "From an artwork detail page, an authenticated user without a profile cannot submit a purchase inquiry; the UI prompts them to complete their profile first.",
        "An authenticated user with a completed profile can submit a purchase inquiry successfully (no regression)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ArtworkDetailsPage.tsx",
          "operation": "modify",
          "description": "Before opening the purchase inquiry flow, add UI gating: if signed out, prompt login; if signed in but missing profile, prompt profile completion (trigger the on-demand profile setup flow). Ensure viewing artwork details remains unrestricted. Use the selected \"authorization\" component’s frontend auth/profile detection patterns. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/inquiries/PurchaseInquiryDialog.tsx",
          "operation": "modify",
          "description": "Add pre-submit guards so the dialog prevents inquiry submission unless the user is authenticated and has a completed profile; show clear prompts/buttons to log in and/or complete profile. Keep successful submission behavior unchanged for users with profiles. Use the selected \"authorization\" component’s guidance for handling authorization failures gracefully and for initiating login via Internet Identity. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure the Artists page consistently renders the full backend-returned artist list by fixing frontend caching/filtering behavior that can drop entries.",
      "acceptanceCriteria": [
        "/artists displays all artist profiles returned by the backend call that powers the Artists page.",
        "Refreshing the page or navigating away/back does not cause the Artists list to drop entries unexpectedly.",
        "If the backend returns N artists, the UI renders N artist cards (unless intentionally paginated, which is not required here)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useArtists.ts",
          "operation": "modify",
          "description": "Adjust the artists query to avoid incomplete/stale rendering (e.g., ensure stable query behavior across navigation, avoid any accidental client-side filtering/deduplication, and make sure mutations that create artist profiles invalidate/refetch the shared ['artists'] cache). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ArtistsPage.tsx",
          "operation": "modify",
          "description": "Ensure the Artists page renders exactly the list returned by the artists query (no additional filtering) and remains stable during refetch/navigation (avoid transient states that can appear as missing entries). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}