{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Private profile name + unique public username in artist profile creation and display (frontend)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add/upgrade the artist profile creation UI to collect private profileName and public username with validation, backend error handling, and cache refresh on success.",
      "acceptanceCriteria": [
        "The creation form includes separate inputs for profile name (private/internal) and username (public display name).",
        "The username field has client-side validation (required; allowed character set; length constraints) and shows inline validation errors.",
        "On username uniqueness errors returned by the backend, the UI displays the backend error message without crashing.",
        "On successful creation, the UI shows a success confirmation and refreshes any cached artist/profile data that depends on the artist profile."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/artists/CreateArtistProfileForm.tsx",
          "operation": "modify",
          "description": "Ensure the creation form clearly separates private profileName vs publicSiteUsername (labeling + helper text), keeps client-side validation for the public username, and renders backend collision errors as user-readable inline/alert text without breaking the UI."
        },
        {
          "path": "frontend/src/hooks/useArtists.ts",
          "operation": "modify",
          "description": "Confirm create-artist-profile mutation invalidates/refetches all relevant react-query caches used across the site (caller artist profile, artists list, and any artwork caches that embed artist display data) after successful creation."
        },
        {
          "path": "frontend/src/pages/EditArtistProfilePage.tsx",
          "operation": "modify",
          "description": "Update the missing-artist-profile state to route users into the dedicated artist profile creation flow (instead of only instructing to submit artwork). Use the authorization component’s authentication guidance (Internet Identity + cache clearing patterns) where applicable; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire a dedicated artist profile creation route into the router (a 'brand new profile flow' page that hosts CreateArtistProfileForm) and ensure it is reachable from existing flows (no orphan page)."
        },
        {
          "path": "frontend/src/pages/CreateArtistProfilePage.tsx",
          "operation": "create",
          "description": "Create a new page that hosts CreateArtistProfileForm, handles authenticated/unauthenticated states (prompt to log in when needed), shows success confirmation, and navigates the user onward after creation. Use the authorization component’s frontend authentication patterns; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Display only the public username on public-facing pages and surfaces, while allowing the authenticated owner to view/edit both profileName and public username.",
      "acceptanceCriteria": [
        "Artists list/cards and any artwork/artist display surfaces show artist.username as the display name.",
        "The artist public profile page shows the username (and other public fields) but not the private profileName.",
        "The edit/owner-only artist profile view allows viewing/editing both profileName (private) and username (public)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ArtistsPage.tsx",
          "operation": "modify",
          "description": "Update artist cards to display the public username field from PublicArtistProfile (publicSiteUsername) as the display name, ensuring no private profileName is rendered in public lists."
        },
        {
          "path": "frontend/src/pages/ArtistProfilePage.tsx",
          "operation": "modify",
          "description": "Ensure the public artist profile header and any other public-facing UI uses the public username field (publicSiteUsername) and never attempts to render private profileName for non-owner views."
        },
        {
          "path": "frontend/src/components/gallery/ArtworkCard.tsx",
          "operation": "modify",
          "description": "Ensure artwork cards derive the artist display name from PublicArtwork.artist.publicSiteUsername (with a safe fallback) so the private profileName is never shown in the gallery grid."
        },
        {
          "path": "frontend/src/pages/ArtworkDetailsPage.tsx",
          "operation": "modify",
          "description": "Ensure the artwork details artist attribution displays the public username field (publicSiteUsername) and not any private/internal name."
        },
        {
          "path": "frontend/src/components/artists/EditArtistProfileForm.tsx",
          "operation": "modify",
          "description": "Align the owner-only edit form fields to the backend interface (publicSiteUsername + profileName) and ensure the owner can view/edit both. Keep backend error messages (including username collisions) visible and user-readable."
        },
        {
          "path": "frontend/src/hooks/useArtists.ts",
          "operation": "modify",
          "description": "Align hook return-field usage throughout to the backend interface naming (PublicArtistProfile.publicSiteUsername; ArtistProfile.publicSiteUsername + profileName) and ensure any mapping is consistent so public pages can never accidentally consume private profileName."
        }
      ]
    }
  ]
}