{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Implement persistent storage and automatic upgrade migration to restore users and uploads from version 14 and preserve them across future canister upgrades.",
  "architectural_notes": [
    "Redesign user and upload storage to persist across canister upgrades (use stable storage + preupgrade/postupgrade migration) and include an automatic migration path from version 14 data."
  ],
  "known_issues": [],
  "isFixRequest": true,
  "existing_features": [],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Restore users and uploads from version 14 by redesigning storage for persistence and performing automatic upgrade preservation/migration with no manual trigger",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Implement stable-memory persistence for all application data so that users and uploads from Version 14 (user profiles, artist profiles, artworks, submissions, purchase inquiries, and ID counters) are preserved across canister upgrades automatically, with no manual trigger.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add explicit upgrade hooks to serialize in-memory Maps and other runtime state into stable variables on upgrade (preupgrade) and restore them on install/upgrade completion (postupgrade), ensuring the runtime Maps are rehydrated correctly.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Implement a conditional, automatic migration path that restores data specifically from Version 14 state shape into the new stable storage format during upgrade, without requiring any manual trigger or admin intervention.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Ensure all mutating operations update the persisted state correctly so that post-upgrade state matches pre-upgrade state, including admin dataset replacement (replaceDataset) and all create/edit/delete flows.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Redesign backend storage for stable persistence and automatic migration from Version 14",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}