{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 7,
  "summary": "New project",
  "architectural_notes": [
    "Implement full stable-memory persistence so users, artist profiles, artworks, submissions, inquiries, and ID counters survive canister upgrades; include migration support for future schema changes."
  ],
  "known_issues": [
    "After deploying Draft Version 14, previously uploaded users and artworks are missing due to lack of stable-memory persistence across upgrades."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-expose-a-ui-control-in-the-admin-dashboard-that-allows-an-admin-to-trigger-the-backend-replace-data-operation-with-a-confirmation-step-ui-requirements-add-a-clearly-labeled-action-english-text-such-as-replace-demo-data-or-replace-users-and-artworks-require-explicit-confirmation-modal-dialog-before-executing-show-success-and-error-feedback-in-the-ui-after-success-refresh-relevant-cached-queries-so-the-gallery-admin-views-reflect-the-replacement-dataset-without-requiring-a-manual-reload",
      "title": "Expose a UI control in the Admin Dashboard that allows an admin to trigger the backend \"replace data\" operation, with a confirmation step.\n\nUI requirements:\n- Add a clearly labeled action (English text) such as \"Replace demo data\" or \"Replace users and artworks\"\n- Require explicit confirmation (modal/dialog) before executing\n- Show success and error feedback in the UI\n- After success, refresh relevant cached queries so the Gallery/Admin views reflect the replacement dataset without requiring a manual reload",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Include previously uploaded art and user profiles in the deployed build (persist and load existing uploads)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Persist user profiles, artist profiles, artworks, submissions, inquiries, and ID counters across canister upgrades so previously uploaded art and profiles remain available after redeploy/upgrade.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Implement upgrade-safe serialization/deserialization for in-memory Maps by storing their contents and counters in stable variables, restoring them on initialization, and ensuring state is correctly written in preupgrade and reloaded in postupgrade (or equivalent stable rehydration pattern).",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "If a schema/state-shape change is required to support stable persistence, add a conditional migration that preserves existing deployed state (including the previously introduced nullable avatar field on user profiles) and safely initializes any new stable fields.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Replace the current users and artwork data/content (update/replace seeded or existing users and artworks in the deployed build).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Add an admin-only backend operation to replace the currently stored user-related and artwork-related data with a fresh dataset.\n\nThis operation must:\n- Remove/overwrite existing stored data for: user profiles, artist profiles, artworks, submissions, and purchase inquiries\n- Reset all ID counters (nextArtworkId, nextSubmissionId, nextInquiryId) to a consistent initial state\n- Insert a small, hardcoded replacement dataset (at minimum: 1 artist profile and 1 artwork, plus any required linking submissions) so the gallery is not empty after replacement\n- Be restricted to admins (trap with a clear error message if called by a non-admin)",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Add full upgrade-safe stable-memory persistence to the backend canister so that user profiles, artist profiles, artworks, submissions, purchase inquiries, and all ID counters survive canister upgrades (no data loss on redeploy/upgrade).",
      "reqIds": [
        "REQ-6"
      ],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Implement upgrade-safe serialization/deserialization for the in-memory Maps in backend/main.mo by writing their contents (and counters) to stable variables during preupgrade and restoring them during postupgrade (or an equivalent stable rehydration pattern).",
      "reqIds": [
        "REQ-7"
      ],
      "status": "pending"
    },
    {
      "id": "AR-9",
      "summary": "Add a schema/version guard for the stable state and a conditional migration path inside backend/main.mo so future state-shape changes can be introduced without breaking upgrades, while preserving existing deployed state (including the nullable avatar field on user profiles).",
      "reqIds": [
        "REQ-8"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Persist and restore previously uploaded artworks and profiles across upgrades",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}