{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-08T13:05:25.151Z",
  "summary": "Diff implements new frontend create/edit flows for artist profiles with separate private profileName and publicSiteUsername fields, and updates several public-facing UI surfaces to display publicSiteUsername. Backend types for ArtistProfile/PublicArtistProfile and public artwork/inquiry views were introduced, and a migration module was added, but the diff excerpt does not provide enough evidence that backend APIs enforce username uniqueness or that all relevant endpoints return only the public view on public calls.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "Backend APIs must return a public artist profile view (excluding private profileName) for public pages/lists, and only allow full ArtistProfile (including profileName) on caller-only endpoints.",
      "reason": "While backend/main.mo defines ArtistProfile and PublicArtistProfile types plus helper conversion functions, the diff summary is truncated before showing the actual query/update methods (e.g., getArtistProfiles / getArtistProfileById) and what they return, so there is insufficient evidence that public endpoints exclusively return the public view and caller-only endpoints return the full profile.",
      "evidence": [
        "backend/main.mo (truncated)"
      ]
    },
    {
      "id": "REQ-2",
      "requirement": "Enforce uniqueness of the public site username when creating or updating an artist profile, and return a clear user-readable error on collisions.",
      "reason": "The diff summary does not show createArtistProfile/updateArtistProfile backend implementation logic or any explicit username index/check across principals, nor does it show the collision error message text. Because backend/main.mo content is truncated, uniqueness enforcement cannot be confirmed from the provided evidence.",
      "evidence": [
        "backend/main.mo (truncated)"
      ]
    }
  ],
  "hallucinated_features": [],
  "confidence": 0.6,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/App.tsx",
    "frontend/src/components/admin/SubmissionsTab.tsx",
    "frontend/src/components/artists/CreateArtistProfileForm.tsx",
    "frontend/src/components/artists/EditArtistProfileForm.tsx",
    "frontend/src/components/gallery/ArtworkCard.tsx",
    "frontend/src/hooks/useArtists.ts",
    "frontend/src/pages/ArtistProfilePage.tsx",
    "frontend/src/pages/ArtistsPage.tsx",
    "frontend/src/pages/ArtworkDetailsPage.tsx",
    "frontend/src/pages/CreateArtistProfilePage.tsx",
    "frontend/src/pages/EditArtistProfilePage.tsx",
    "project_state.json"
  ]
}